## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 19 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                   NAME                                                   |
|--------|----------------------------------------------------------------------------------------------------------|
| update | `aws_kinesis_firehose_delivery_stream.api_waf`                                                           |
|        | `module.scan_files[&quot;api&quot;].aws_cloudwatch_query_definition.lambda_statistics`                             |
|        | `module.scan_files[&quot;api&quot;].aws_iam_policy.policies[0]`                                                    |
| add    | `aws_cloudfront_distribution.scan_files[&quot;api-provisioned&quot;]`                                              |
|        | `aws_lambda_alias.api_provisioned_latest`                                                                |
|        | `aws_lambda_function_url.scan_files[&quot;api-provisioned&quot;]`                                                  |
|        | `aws_lambda_provisioned_concurrency_config.api_provisioned`                                              |
|        | `aws_route53_record.sync_scan_files_A`                                                                   |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_cloudwatch_log_group.this`                                     |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_cloudwatch_query_definition.lambda_statistics`                 |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_policy.policies[0]`                                        |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_policy.policies[1]`                                        |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_policy.policies[2]`                                        |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_policy.vpc_policies[0]`                                    |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_role.this`                                                 |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0]` |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_role_policy_attachment.attachments[0]`                     |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_role_policy_attachment.attachments[1]`                     |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_role_policy_attachment.attachments[2]`                     |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_role_policy_attachment.lambda_insights[0]`                 |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_iam_role_policy_attachment.vpc_policies[0]`                    |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_lambda_function.this`                                          |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/scan-files/actions/runs/8179290099).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:806545929748:log-group:*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:Get*",
              + "s3:GetBucketLocation",
              + "s3:ListBucket",
              + "s3:ListBucketVersions",
              + "s3:Put*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::scan-files-production-clamav-defs",
              + "arn:aws:s3:::scan-files-production-clamav-defs/*",
              + "arn:aws:s3:::scan-files-production-file-queue",
              + "arn:aws:s3:::scan-files-production-file-queue/*",
            ]
        }
      + statement {
          + actions   = [
              + "states:CreateActivity",
              + "states:DescribeExecution",
              + "states:ListActivities",
              + "states:ListStateMachines",
              + "states:StopExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:806545929748:*",
            ]
        }
      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue",
            ]
        }
      + statement {
          + actions   = [
              + "events:DescribeRule",
              + "events:PutRule",
              + "events:PutTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
              + "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api",
              + (known after apply),
            ]
        }
    }

  # aws_cloudfront_distribution.scan_files_api has moved to aws_cloudfront_distribution.scan_files["api"]
    resource "aws_cloudfront_distribution" "scan_files" {
        id                             = "EI4T979V99J61"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_cloudfront_distribution.scan_files["api-provisioned"] will be created
  + resource "aws_cloudfront_distribution" "scan_files" {
      + aliases                         = [
          + "sync.scan-files.alpha.canada.ca",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = "arn:aws:wafv2:us-east-1:806545929748:global/webacl/api_waf/50d70bf4-78f8-4570-b91a-33777a679942"

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = false
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = "12985cc0-d422-4ee5-844b-74125f0c6c19"
          + target_origin_id           = "scan-files-api-provisioned"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Authorization",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = "scan-files-production-logs.s3.amazonaws.com"
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "/healthcheck"
          + response_headers_policy_id = "12985cc0-d422-4ee5-844b-74125f0c6c19"
          + target_origin_id           = "scan-files-api-provisioned"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "scan-files-api-provisioned"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:806545929748:certificate/0c5ad00b-ec1e-4b76-92cf-06b41a5ca9c3"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_kinesis_firehose_delivery_stream.api_waf will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "api_waf" {
        id             = "arn:aws:firehose:us-east-1:806545929748:deliverystream/aws-waf-logs-scan-files"
        name           = "aws-waf-logs-scan-files"
        tags           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          + custom_time_zone   = "UTC"
            # (7 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_alias.api_provisioned_latest will be created
  + resource "aws_lambda_alias" "api_provisioned_latest" {
      + arn              = (known after apply)
      + description      = "The most recently deployed version of the API"
      + function_name    = (known after apply)
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "latest"
    }

  # aws_lambda_function_url.scan_files_url has moved to aws_lambda_function_url.scan_files["api"]
    resource "aws_lambda_function_url" "scan_files" {
        id                 = "scan-files-api"
        # (6 unchanged attributes hidden)
    }

  # aws_lambda_function_url.scan_files["api-provisioned"] will be created
  + resource "aws_lambda_function_url" "scan_files" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "scan-files-api-provisioned"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + qualifier          = "latest"
      + url_id             = (known after apply)
    }

  # aws_lambda_provisioned_concurrency_config.api_provisioned will be created
  + resource "aws_lambda_provisioned_concurrency_config" "api_provisioned" {
      + function_name                     = "scan-files-api-provisioned"
      + id                                = (known after apply)
      + provisioned_concurrent_executions = 1
      + qualifier                         = "latest"
      + skip_destroy                      = false
    }

  # aws_route53_record.sync_scan_files_A will be created
  + resource "aws_route53_record" "sync_scan_files_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sync.scan-files.alpha.canada.ca"
      + type            = "A"
      + zone_id         = "Z09208862AM3U6FRXOHM8"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.api.aws_cloudwatch_log_group.this has moved to module.scan_files["api"].aws_cloudwatch_log_group.this
    resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/lambda/scan-files-api"
        name              = "/aws/lambda/scan-files-api"
        tags              = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.scan_files["api"].aws_cloudwatch_query_definition.lambda_statistics will be updated in-place
  # (moved from module.api.aws_cloudwatch_query_definition.lambda_statistics)
  ~ resource "aws_cloudwatch_query_definition" "lambda_statistics" {
        id                  = "72cc197f-58a4-4974-ad6b-92fc3be9a310"
      ~ log_group_names     = [
          - "aws_cloudwatch_log_group.this",
          + "/aws/lambda/scan-files-api",
        ]
        name                = "Lambda Statistics - scan-files-api"
        # (2 unchanged attributes hidden)
    }

  # module.scan_files["api"].aws_iam_policy.policies[0] will be updated in-place
  # (moved from module.api.aws_iam_policy.policies[0])
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api-0"
        name      = "scan-files-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-production-file-queue/*",
                          - "arn:aws:s3:::scan-files-production-file-queue",
                          - "arn:aws:s3:::scan-files-production-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-production-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_iam_policy.policies[1] has moved to module.scan_files["api"].aws_iam_policy.policies[1]
    resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api-1"
        name      = "scan-files-api-1"
        tags      = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_iam_policy.policies[2] has moved to module.scan_files["api"].aws_iam_policy.policies[2]
    resource "aws_iam_policy" "policies" {
        id          = "arn:aws:iam::806545929748:policy/scan-files-api-2"
        name        = "scan-files-api-2"
        tags        = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.api.aws_iam_policy.vpc_policies[0] has moved to module.scan_files["api"].aws_iam_policy.vpc_policies[0]
    resource "aws_iam_policy" "vpc_policies" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api_vpc"
        name      = "scan-files-api_vpc"
        tags      = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_iam_role.this has moved to module.scan_files["api"].aws_iam_role.this
    resource "aws_iam_role" "this" {
        id                    = "scan-files-api"
        name                  = "scan-files-api"
        tags                  = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] has moved to module.scan_files["api"].aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0]
    resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
        id         = "scan-files-api-20220621174717070000000001"
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_iam_role_policy_attachment.attachments[0] has moved to module.scan_files["api"].aws_iam_role_policy_attachment.attachments[0]
    resource "aws_iam_role_policy_attachment" "attachments" {
        id         = "scan-files-api-20220621174717072000000002"
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_iam_role_policy_attachment.attachments[1] has moved to module.scan_files["api"].aws_iam_role_policy_attachment.attachments[1]
    resource "aws_iam_role_policy_attachment" "attachments" {
        id         = "scan-files-api-20220621174717091200000005"
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_iam_role_policy_attachment.attachments[2] has moved to module.scan_files["api"].aws_iam_role_policy_attachment.attachments[2]
    resource "aws_iam_role_policy_attachment" "attachments" {
        id         = "scan-files-api-20220628195915580400000001"
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_iam_role_policy_attachment.lambda_insights[0] has moved to module.scan_files["api"].aws_iam_role_policy_attachment.lambda_insights[0]
    resource "aws_iam_role_policy_attachment" "lambda_insights" {
        id         = "scan-files-api-20220621174717088600000004"
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_iam_role_policy_attachment.vpc_policies[0] has moved to module.scan_files["api"].aws_iam_role_policy_attachment.vpc_policies[0]
    resource "aws_iam_role_policy_attachment" "vpc_policies" {
        id         = "scan-files-api-20220621174717085100000003"
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_lambda_function.this has moved to module.scan_files["api"].aws_lambda_function.this
    resource "aws_lambda_function" "this" {
        id                             = "scan-files-api"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.scan_files["api-provisioned"].aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/scan-files-api-provisioned"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.scan_files["api-provisioned"].aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/scan-files-api-provisioned",
        ]
      + name                = "Lambda Statistics - scan-files-api-provisioned"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
    }

  # module.scan_files["api-provisioned"].aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned-0"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.scan_files["api-provisioned"].aws_iam_policy.policies[1] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned-1"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:/scan-files/api_auth_token-1tLf9T"
                    },
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ca-central-1:806545929748:key/c71bf0dd-721d-4f36-be85-5bea7927ad43"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.scan_files["api-provisioned"].aws_iam_policy.policies[2] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned-2"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (sensitive value)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.scan_files["api-provisioned"].aws_iam_policy.vpc_policies[0] will be created
  + resource "aws_iam_policy" "vpc_policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "scan-files-api-provisioned_vpc"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:806545929748:repository/scan-files/api"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.scan_files["api-provisioned"].aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-files-api-provisioned"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.scan_files["api-provisioned"].aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "scan-files-api-provisioned"
    }

  # module.scan_files["api-provisioned"].aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-api-provisioned"
    }

  # module.scan_files["api-provisioned"].aws_iam_role_policy_attachment.attachments[1] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-api-provisioned"
    }

  # module.scan_files["api-provisioned"].aws_iam_role_policy_attachment.attachments[2] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-api-provisioned"
    }

  #...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
